DuckieOnQuacks/Self-Balancing-Cube/esp32_cube_enc/web_interface.cpp
<details id="trc"><summary>Trace</summary><div class="bd">
<canvas id="tc" width="640" height="200"
 style="width:100%;height:150px;background:var(--bg);border:1px solid var(--ln);
 border-radius:8px"></canvas>
<div class="st" id="tl" style="margin:8px 0 0"></div>
<div class="ab">
<button class="b" id="tpause">Pause</button>
<button class="b" id="tsave">Download CSV</button></div>
<p class="note" id="tn">Live at the full 66.7 Hz control rate — the numeric
readouts above only sample at 3.3 Hz. Open while tuning: oscillation means
more damping (K2), slow wander means more angle gain (K1).</p>
</div></details>

<details><summary>Motion</summary><div class="bd">
<div style="display:flex;justify-content:space-between;align-items:baseline">
<span class="k">Yaw rate</span><b class="m" id="yv">0 °/s</b></div>
<input type="range" id="yaw" min="-90" max="90" step="5" value="0">
<button class="b w1" id="ystop" style="margin-top:8px">Stop spin</button>
<p class="note">Spins the cube about its vertical axis while balancing.
Returns to zero on stop, disarm or arm.</p>
<div style="display:flex;justify-content:space-between;align-items:baseline">
<span class="k">Learned trim</span><b class="m" id="tv">—</b></div>
<p class="note" id="tn">Auto-trim is off. Set the tK gain above zero to
enable it.</p>
<button class="b w1" id="treset">Reset trim</button>
<p class="note">Saved with the gains, so it applies from the next boot.
Reset it after changing the cube's hardware, then save again.</p>
</div></details>

<details><summary>Calibration</summary><div class="bd">
<p class="note" id="ch">—</p>
<p class="note" id="cr" style="color:var(--live)"></p>
<p class="note" id="raw" style="font-family:ui-monospace,monospace;font-size:11px">
raw</p>
<div class="ab" style="margin:0">
<button class="b" id="cstart">Start</button>
<button class="b" id="ccap">Capture pose</button>
<button class="b w1" id="csave">Save calibration</button></div>
</div></details>

<details><summary>Gains</summary><div class="bd">
<div id="gl" class="gl">Loading…</div>
<div class="ab">
<button class="b" id="gapply">Apply</button>
<button class="b" id="gdef">Restore defaults</button>
<button class="b w1" id="gsave">Save gains + trim</button></div>
<p class="note" id="gm" style="margin:12px 0 0">Changes take effect at once.
They are lost on restart until you save.</p>
</div></details>

<script>
var $=function(i){return document.getElementById(i);};
var busy=false;                        // one request at a time: the ESP32
                                       // WebServer serves a single client,
                                       // so never let polls pile up
var mmax=40;                           // motor bar full-scale, auto-ranging
function pill(el,cls,txt){el.textContent=txt;el.className='p '+cls;}
// Degrees -> radius. sqrt so 0.5 deg is visible while 7 deg lands on the ring.
function rad(a){
 var m=Math.min(Math.abs(a)/7,1);
 return (a<0?-1:1)*Math.sqrt(m)*70;
}
// Same curve for the edge pendulum, mapped to +/-22 deg of visible rotation
// so the cube reads as tipping without leaving the frame.
function tilt(a){return rad(a)/70*22;}
function poll(){
 if(busy)return; busy=true;
 fetch('/api/state',{cache:'no-store'}).then(function(r){return r.json();})
 .then(function(d){
  $('ax').textContent=d.robot_angleX.toFixed(2)+'°';
  $('ay').textContent=d.robot_angleY.toFixed(2)+'°';
  $('dot').setAttribute('cx',100+rad(d.robot_angleX));
  $('dot').setAttribute('cy',100-rad(d.robot_angleY));
  // Green inside the vertex capture window, amber once it is drifting.
  var q=Math.abs(d.robot_angleX)<0.4&&Math.abs(d.robot_angleY)<0.4;
  $('dot').setAttribute('class',q?'q':'');  // SVG: className is read-only
  // Edge pendulum. Both visualizers are updated unconditionally - it is two
  // attribute writes - and CSS shows whichever one matches the pose.
  $('ebody').setAttribute('transform',
    'rotate('+tilt(d.robot_angleX).toFixed(2)+',100,170)');
  $('ecube').setAttribute('class',
    'cube'+(Math.abs(d.robot_angleX)<0.4?' q':''));
  // Edge mode only when the firmware is actually in it; anything else keeps
  // the general-purpose attitude target.
  document.body.classList.toggle('e',d.vertical_edge&&!d.vertical_vertex);
  var s=[d.motor1_speed,d.motor2_speed,d.motor3_speed];
  mmax=Math.max(40,Math.abs(s[0]),Math.abs(s[1]),Math.abs(s[2]));
  for(var i=0;i<3;i++){
   $('m'+(i+1)).textContent=s[i];
   $('b'+(i+1)).style.width=(Math.abs(s[i])/mmax*100)+'%';
  }
  $('bv').textContent=d.batt_voltage.toFixed(2)+' V';
  $('lamp').className=d.armed?'a':'';
  pill($('armed'),d.armed?'live':'off',d.armed?'ARMED':'DISARMED');
  pill($('cal'),d.calibrated?'on':'off',
       d.calibrating?'CALIBRATING':(d.calibrated?'CALIBRATED':'NOT CALIBRATED'));
  // Pose is detected even while disarmed, so only colour it when it can act.
  var m=d.vertical_vertex?'VERTEX':(d.vertical_edge?'EDGE':'IDLE');
  pill($('mode'),(d.vertical_vertex||d.vertical_edge)&&d.armed?'live':'',m);
  // Tell the user which calibration step comes next.  Calibration is
  // blocked while balancing, so say that instead when it applies.
  var bal=d.armed&&(d.vertical_vertex||d.vertical_edge)&&d.calibrated
          &&!d.calibrating;
  $('ch').textContent=
   bal?'Balancing. Press DISARM before calibrating.':
   (!d.calibrating?'Idle. Press Start to begin.':
   (!d.vertex_calibrated?'Step 1 — set the cube on a VERTEX, then capture.':
    'Step 2 — set the cube on an EDGE, then capture. Saves automatically.'));
  // Result of the last capture, plus the raw counts the pose test actually
  // uses. Both used to be Bluetooth-only.
  $('cr').textContent=d.cal_result||'';
  $('raw').textContent='raw  X '+d.acX+'   Y '+d.acY+'   Z '+d.acZ;
  // Learned balance-point trim. Only meaningful once tK is above zero.
  $('tv').textContent=d.trimX.toFixed(2)+'° / '+d.trimY.toFixed(2)+'°';
  var tk=G&&G.tK?G.tK.v:0;
  $('tn').textContent=tk>0
   ?'Auto-trim active (tK '+tk+'). Values settle as the cube balances.'
   :'Auto-trim is off. Set the tK gain above zero to enable it.';
  // Reflect the firmware's actual yaw command unless the user is dragging.
  if(!dragging)$('yv').textContent=d.yaw_rate.toFixed(0)+' °/s';
  // Don't erase a command result the user has not had time to read.
  if(Date.now()>msgUntil)$('s').textContent='live';
 }).catch(function(){$('s').textContent='no signal';})
 // Chain the trace fetch AFTER the state response so there is never more
 // than one request in flight - the ESP32 serves a single client.  Its
 // failure must not mark the whole link down, hence the inner catch.
 .then(function(){
  if($('trc').open)return pollTrace().catch(function(){});
 })
 .then(function(){busy=false;});
}
setInterval(poll,300);                 // 300 ms refresh (spec: 250-500 ms)
poll();
// --- telemetry trace --------------------------------------------------
// Samples accumulate here at the full 66.7 Hz control rate; the chart is a
// window onto the tail. Capped at 8000 samples (~2 min) to bound memory.
var T=[],tSeq=0,tPause=false;
// [csv column, colour, scale full-range, default on, label]
var CH=[['ax','#ffab1f',800,1,'tilt X'],  // centidegrees, +/-8 deg window
        ['ay','#3ecf8e',800,1,'tilt Y'],
        ['gx','#9aa3af',2500,0,'gyro X'], // tenths of deg/s
        ['gy','#58a6ff',2500,0,'gyro Y'],
        ['px','#ff453a',255,1,'pwm X'],
        ['py','#c084fc',255,0,'pwm Y'],
        ['m3','#f97316',450,0,'wheel 3']];
function pollTrace(){
 return fetch('/api/trace?since='+tSeq,{cache:'no-store'})
 .then(function(r){return r.text();})
 .then(function(txt){
  var rows=txt.trim().split('\n');
  for(var i=1;i<rows.length;i++){       // row 0 is the header
   var v=rows[i].split(',').map(Number);
   if(v.length<11)continue;
   // A gap in seq means the ring lapped us; break the line honestly.
   if(T.length&&v[0]>tSeq+1)T.push(null);
   tSeq=v[0];
   T.push(v);
  }
  if(T.length>8000)T.splice(0,T.length-8000);
  if(!tPause)drawTrace();
 });
}
function drawTrace(){
 var c=$('tc'),g=c.getContext('2d'),W=c.width,H=c.height;
 g.clearRect(0,0,W,H);
 g.strokeStyle='#243039';g.beginPath();          // zero line
 g.moveTo(0,H/2);g.lineTo(W,H/2);g.stroke();
 var N=400,start=Math.max(0,T.length-N);         // ~6 s window
 CH.forEach(function(ch){
  if(!ch[3])return;
  var col={ax:2,ay:3,gx:4,gy:5,m1:6,m2:7,m3:8,px:9,py:10}[ch[0]];
  g.strokeStyle=ch[1];g.beginPath();
  var pen=false;
  for(var i=start;i<T.length;i++){
   var s=T[i];
   if(!s){pen=false;continue;}                   // gap: lift the pen
   var x=(i-start)/N*W;
   var y=H/2-(s[col]/ch[2])*(H/2-4);
   if(pen)g.lineTo(x,y);else{g.moveTo(x,y);pen=true;}
  }
  g.stroke();
 });
}
// Legend chips double as channel toggles.
CH.forEach(function(ch,i){
 var b=document.createElement('span');
 b.className='p'+(ch[3]?' on':'');
 b.style.cursor='pointer';b.style.borderColor=ch[1];b.textContent=ch[4];
 b.onclick=function(){ch[3]=ch[3]?0:1;b.className='p'+(ch[3]?' on':'');drawTrace();};
 $('tl').appendChild(b);
});
$('tpause').onclick=function(){
 tPause=!tPause;this.textContent=tPause?'Resume':'Pause';
 if(!tPause)drawTrace();
};
