DuckieOnQuacks/Self-Balancing-Cube/esp32_cube_enc/web_interface.cpp
$('tsave').onclick=function(){
 // Rebuild CSV from everything accumulated, gaps marked as blank lines.
 var out='seq,t,ax,ay,gx,gy,m1,m2,m3,px,py\n';
 T.forEach(function(s){out+=s?s.join(',')+'\n':'\n';});
 var a=document.createElement('a');
 a.href=URL.createObjectURL(new Blob([out],{type:'text/csv'}));
 a.download='cube-trace.csv';a.click();
 URL.revokeObjectURL(a.href);
};
// --- button feedback --------------------------------------------------
// A press has to be visibly acknowledged even over a slow AP link, so every
// command button greys out while its request is in flight, then flashes the
// outcome.  msgUntil holds the header text against the 300 ms poll.
var msgUntil=0;
function say(t){$('s').textContent=t;msgUntil=Date.now()+2500;}
function flash(b,ok){
 if(!b)return;
 b.disabled=false;
 b.classList.remove('ok','er');
 void b.offsetWidth;                   // reflow: restarts the animation when
 b.classList.add(ok?'ok':'er');        // the same button is pressed again
}
// Sends a command request only; the main control loop acts on it.
function send(cmd,b){
 var n=cmd.replace('_',' ');
 // SAFE STOP is never disabled - a hung request must not make it unpressable.
 // Everything else re-enables on a watchdog in case no response ever arrives.
 if(b&&b.id!='stop'){b.disabled=true;
  setTimeout(function(){b.disabled=false;},3000);}
 say(n+'…');
 fetch('/api/command',{method:'POST',
  headers:{'Content-Type':'application/x-www-form-urlencoded'},
  body:'cmd='+cmd})
 .then(function(r){return r.text().then(function(t){
   // Show the firmware's own reason ("disarm first", "stop pending") rather
   // than a bare status code - that is the part worth reading.
   var e='';try{e=JSON.parse(t).error||'';}catch(x){}
   say(r.ok?n+' sent':n+' rejected — '+(e||r.status));
   flash(b,r.ok);
  });})
 .catch(function(){say(n+' failed');flash(b,false);});
}
// One binder for every command button, with an optional confirmation.
function bind(id,cmd,ask){$(id).onclick=function(){
 if(ask&&!confirm(ask))return;
 send(cmd,this);};}
bind('stop','stop');
bind('disarm','disarm');
// Arming re-enables balancing, so require a deliberate confirmation.
bind('arm','arm','Arm the cube? Balancing will resume.');
// --- gain editing -----------------------------------------------------
// The form is built from /api/gains so the firmware's gain table stays the
// single source of truth: add a gain there and it appears here too.
var G=null;
function loadG(){
 fetch('/api/gains',{cache:'no-store'}).then(function(r){return r.json();})
 .then(function(g){
  G=g; var h='';
  for(var k in g){
   h+='<label class="gr"><span>'+k+'</span><input id="g_'+k+
      '" type="number" step="any" min="'+g[k].lo+'" max="'+g[k].hi+
      '" value="'+(+g[k].v.toFixed(4))+'"></label>';
  }
  $('gl').innerHTML=h;
 });
}
loadG();
function applyG(btn){
 if(!G)return;
 // Send every field; the firmware validates each one and rejects the whole
 // request if any is out of range.
 var b=[];
 for(var k in G){b.push(k+'='+$('g_'+k).value);}
 if(btn)btn.disabled=true;
 $('gm').textContent='Applying…';
 fetch('/api/gains',{method:'POST',
  headers:{'Content-Type':'application/x-www-form-urlencoded'},
  body:b.join('&')})
 .then(function(r){return r.json().then(function(j){
   $('gm').textContent=r.ok?'Applied. Save to keep them after a restart.'
                           :('Rejected — '+j.error);
   flash(btn,r.ok);
   if(r.ok)loadG();                    // re-read what the firmware accepted
  });})
 .catch(function(){$('gm').textContent='Apply failed.';flash(btn,false);});
}
$('gapply').onclick=function(){applyG(this);};
$('gdef').onclick=function(){
 // Restore Defaults just fills the form with the firmware's defaults and
 // applies them - still not saved until SAVE is pressed.
 if(!G||!confirm('Restore default gains?'))return;
 for(var k in G){$('g_'+k).value=+G[k].d.toFixed(4);}
 applyG(this);
};
bind('gsave','gains_save','Save gains and the learned trim to EEPROM?');
// --- yaw slider -------------------------------------------------------
// Dragging fires continuously, so the rate is sent at most every 150 ms.
// The ESP32 serves one client at a time; an unthrottled slider would queue
// requests faster than they drain and stall the telemetry poll.
var dragging=false,ySent=0,yPend=null;
function sendYaw(v){
 fetch('/api/command',{method:'POST',
  headers:{'Content-Type':'application/x-www-form-urlencoded'},
  body:'cmd=yaw&rate='+v})
 .catch(function(){$('s').textContent='yaw failed';});
}
function yawChanged(){
 var v=$('yaw').value;
 $('yv').textContent=v+' °/s';
 var now=Date.now();
 if(now-ySent>150){ySent=now;sendYaw(v);}
 else{clearTimeout(yPend);
      yPend=setTimeout(function(){ySent=Date.now();sendYaw($('yaw').value);},150);}
}
$('yaw').oninput=function(){dragging=true;yawChanged();};
$('yaw').onchange=function(){dragging=false;yawChanged();};
$('ystop').onclick=function(){$('yaw').value=0;dragging=false;yawChanged();
 flash(this,true);say('spin stopped');};
bind('treset','trim_reset');
bind('cstart','cal_start');
bind('ccap','cal_capture');
// Saving writes EEPROM, so confirm before spending a write cycle.
bind('csave','cal_save','Save calibration to EEPROM?');
</script></body></html>)rawliteral";

// GET /  — serve the dashboard straight from flash, pre-gzipped at build
// time (see tools/gzip_dashboard.py).  handleClient() pushes the whole page
// synchronously from loop(), stalling the control loop for the duration of
// the transfer, so the ~2.7x smaller gzip body directly shortens that stall.
// Every browser since ~2000 accepts gzip; no fallback needed on a device
// whose only clients are phones pointed at its own access point.
void handleRoot() {
  webServer.sendHeader("Content-Encoding", "gzip");
  webServer.send_P(200, "text/html",
                   reinterpret_cast<const char*>(DASHBOARD_GZ),
                   DASHBOARD_GZ_LEN);
}

// GET /api/state  — read-only telemetry snapshot as JSON.
//
// This handler only READS shared state; it never commands the motors.
// No locking is needed: handleWebInterface() is called from the same loop()
// as the balancing code, so this can never interrupt a control iteration
// mid-update — the values below are always from a completed iteration.
void handleApiState() {
  // Fixed stack buffer instead of String concatenation: bounded memory and
  // no heap fragmentation on a long-running controller.
  // 640 rather than 512: the raw accelerometer values and cal_result string
  // added when Bluetooth was removed push the worst case past the old size,
  // and snprintf truncates silently - which would emit malformed JSON.
  char json[640];
  int n = snprintf(json, sizeof(json),
    "{"
      "\"robot_angleX\":%.3f,"
      "\"robot_angleY\":%.3f,"
      "\"gyroXfilt\":%.3f,"
      "\"gyroYfilt\":%.3f,"
      "\"gyroZ\":%.3f,"
      "\"motor1_speed\":%d,"
      "\"motor2_speed\":%d,"
      "\"motor3_speed\":%d,"
      "\"speed_X\":%.3f,"
      "\"speed_Y\":%.3f,"
      "\"vertical_vertex\":%s,"
      "\"vertical_edge\":%s,"
      "\"calibrated\":%s,"
      "\"calibrating\":%s,"
      "\"vertex_calibrated\":%s,"
      "\"armed\":%s,"
      "\"batt_voltage\":%.2f,"
      // Raw accelerometer counts.  During a first-time calibration the
      // corrected angles above are computed from EEPROM garbage, so these
      // are the only trustworthy numbers - and the pose accept/reject
      // thresholds are applied to exactly these values.
      "\"acX\":%d,"
      "\"acY\":%d,"
      "\"acZ\":%d,"
      // Learned balance-point offset and the active yaw command.
      "\"trimX\":%.3f,"
      "\"trimY\":%.3f,"
      "\"yaw_rate\":%.1f,"
      "\"cal_result\":\"%s\""
    "}",
    robot_angleX, robot_angleY,
    gyroXfilt, gyroYfilt, gyroZ,
    motor1_speed, motor2_speed, motor3_speed,
    speed_X, speed_Y,
    // JSON has no C-style booleans, so emit the literals true/false.
    vertical_vertex ? "true" : "false",
    vertical_edge   ? "true" : "false",
    calibrated      ? "true" : "false",
    calibrating       ? "true" : "false",
    vertex_calibrated ? "true" : "false",
    armed             ? "true" : "false",
    batt_voltage,
    AcX, AcY, AcZ, trimX, trimY, yaw_rate_cmd,
    cal_result);
  // Truncated JSON would be malformed, so refuse to send it rather than let
  // the dashboard silently fail to parse.
  if (n < 0 || n >= (int)sizeof(json)) {
    webServer.send(500, "application/json",
                   "{\"ok\":false,\"error\":\"state buffer overflow\"}");
    return;
  }
  webServer.send(200, "application/json", json);
}

