DuckieOnQuacks/Self-Balancing-Cube/esp32_cube_enc/web_interface.cpp
  // A stop already waiting to be processed always wins.  Without this, an
  // arm arriving in the same 15 ms window could overwrite a pending stop
  // and the cube would never stop at all.
  if (web_cmd_pending == WEB_CMD_STOP && req != WEB_CMD_STOP) {
    webServer.send(409, "application/json",
                   "{\"ok\":false,\"error\":\"stop pending\"}");
    return;
  }
  web_cmd_pending = req;

  char json[64];
  snprintf(json, sizeof(json), "{\"ok\":true,\"cmd\":\"%s\"}", cmd.c_str());
  webServer.send(200, "application/json", json);
}

// Called once from setup(): bring up the access point, register routes,
// and start the HTTP server.
void startWebInterface() {
  WiFi.mode(WIFI_AP);                      // stand-alone AP, no router needed

  // softAP() returns false if the AP could not be started.  The most common
  // cause is a password shorter than the 8-character WPA2 minimum, which
  // makes the network silently never appear — so report failure loudly.
  if (!WiFi.softAP(WIFI_NAME, WIFI_PASSWORD)) {
    Serial.println("ERROR: Wi-Fi AP failed to start!"
                   "  (password must be at least 8 characters)");
    // No AP means no dashboard, and therefore no SAFE STOP button.  Do not
    // leave the cube able to spin up three reaction wheels with no reachable
    // way to stop it: disarm, and let the operator re-arm over USB serial
    // once they can see what is going on.
    armed = false;
    Serial.println("Balancing disarmed: no web interface available.");
    return;                                // no AP: skip starting the server
  }

  // Print the address the phone should open (the AP's own IP).
  Serial.print("Wi-Fi AP \"");
  Serial.print(WIFI_NAME);
  Serial.print("\" started.  Open http://");
  Serial.println(WiFi.softAPIP());

  webServer.on("/", HTTP_GET, handleRoot);
  webServer.on("/api/state", HTTP_GET, handleApiState);
  webServer.on("/api/command", HTTP_POST, handleApiCommand);
  webServer.on("/api/trace", HTTP_GET, handleApiTrace);
  webServer.on("/api/gains", HTTP_GET, handleApiGains);
  webServer.on("/api/gains", HTTP_POST, handleApiGainsSet);
  webServer.begin();
}

// Called every pass of loop(): service at most one pending HTTP request.
// handleClient() is non-blocking and returns immediately when idle, so it
// does not disturb the 15 ms balancing period.
void handleWebInterface() {
  webServer.handleClient();
}
